# Задача 8
# Требуется определить, можно ли от шоколадки 
# размером n × m долек отломить k долек, если разрешается 
# сделать один разлом по прямой между дольками 
# (то есть разломить шоколадку на два прямоугольника).
# Пример:
# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input("Введите один размер шоколадки в дольках: "))
m = int(input("Введите другой размер шоколадки в дольках: "))

k = int(input("Введите количество долек, которое хотите отломить: "))

if k < m * n and (k % m == 0 or k % n == 0):
    print('Да')
else:
    print('Нет')



n = int(input('Введите число:\n'))

for num in range(2, n + 1):
    if n % num != 0:
        continue
    flag = True
    for spam in range(num - 1, 1, -1):
        if num % spam == 0:
            flag = False
            break
    if flag:
        print(num, end=' ')